In [27]:
import pandas as pd #import pandas library

In [28]:
 pd.read_csvdf =("employees.csv") #import data and save in the library

In [29]:
df.head(3) #display the top 3 items

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

In [30]:
df.info() #display the type of the columns in the df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null object
Last Login Time      1000 non-null object
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [31]:
df["Start Date"].head(3) #display the top 3 items in the start date column

0     8/6/1993
1    3/31/1996
2    4/23/1993
Name: Start Date, dtype: object

In [32]:
df["Start Date"] = pd.to_datetime(df["Start Date"]) #convert to the date column to the date type of pandas

In [33]:
df["Start Date"].head(3) #display the top 3 items of column

0   1993-08-06
1   1996-03-31
2   1993-04-23
Name: Start Date, dtype: datetime64[ns]

In [16]:
df["Last Login Time"].head(3) #display t

0    12:42 PM
1     6:53 AM
2    11:17 AM
Name: Last Login Time, dtype: object

In [19]:
pd.to_datetime(df["Last Login Time"]).head(3) #records the last date accessed to the column by default initiating the current date

0   2019-09-12 12:42:00
1   2019-09-12 06:53:00
2   2019-09-12 11:17:00
Name: Last Login Time, dtype: datetime64[ns]

In [20]:
df["Last Login Time"] = pd.to_datetime(df["Last Login Time"])

In [22]:
df["Senior Management"] = df["Senior Management"].astype("bool") # convert the column of objects to column of bools

In [25]:
df["Gender"] = df["Gender"].astype("category") #convert the type to catagory to help reduce the memory space used

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

## Filter A dataframe Based On a Condition

In [39]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])
df.info()
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.info()
df.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null object
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    933 non-null object
Team                 957 non-null object
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 62.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.0+ KB

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-09-13 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-09-13 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-09-13 11:17:00,130590,11.858,False,Finance

In [43]:
df[df["Gender"] == "Male"] #extract all the males from the data set
Output = False

In [47]:
mask = df["Team"] == "Finance"
df[mask] #extract all the finance people like this
Output = False

In [50]:
df[df["Senior Management"]] #extract only the Trues in the column
Output = False

In [53]:
mask = df["Team"] != "Marketing" #extract everything BUT Marketing
df[mask]
Output = False

In [58]:
df[df["Salary"] > 110000] #extract columns more than 110000
df[df["Bonus %"] < 1.5] # extract bonuses less than 1.5
Output = False

In [62]:
df["Start Date"] <= "1985-01-01" # extract data that start a
df[mask]
Output = False

## Filter with More than on Condition (AND)

In [67]:
df = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-09-13 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-09-13 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-09-13 11:17:00,130590,11.858,False,Finance

In [72]:
mask1 = df["Gender"] == "Male"
mask2 = df["Team"] == "Marketing"
df[mask1 & mask2] # extract data that meet only these two conditions
Output = False

## Filter with More than One Condition (OR)

In [76]:
mask3 = df["Senior Management"]
mask4 = df["Start Date"] < "1990-01-01"
df[mask1 | mask2]
Output = False

In [85]:
mask5 = df["First Name"] == "Robert"
mask6 = df["Team"] == "Client Services"
mask7 = df["Start Date"] > "2016-06-01"
df[(mask5 & mask6) | mask7]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2019-09-13 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2019-09-13 19:47:00,100705,16.961,True,Marketing
387,Robert,Male,1994-10-29,2019-09-13 04:26:00,123294,19.894,False,Client Services
451,Terry,NaN,2016-07-15,2019-09-13 00:29:00,140002,19.490,True,Marketing

## The .isin() Method

In [89]:
df = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("bool")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,True,1993-08-06,2019-09-13 12:42:00,97308,6.945,True,Marketing
1,Thomas,True,1996-03-31,2019-09-13 06:53:00,61933,4.170,True,NaN
2,Maria,True,1993-04-23,2019-09-13 11:17:00,130590,11.858,False,Finance

In [94]:
#to seperate multiple catagories of the team in the column
mask8 = df["Team"] == "Legal"
mask9 = df["Team"] == "Sales"
mask10 = df["Team"] == "Product"
df[mask8 | mask9 | mask10]
Output = False

In [99]:
#this is the better way
mask11 = df["Team"].isin(["Legal", "Sales", "Product"])
df[mask11]
Output = False

## The .isnull() and .notnull() Method

In [103]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-09-13 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-09-13 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-09-13 11:17:00,130590,11.858,False,Finance

In [107]:
mask = df["Team"].isnull()
df[mask]
Output = False

In [112]:
mask2 = df["Gender"].notnull()
df[mask2]
Output = False

## The .between() Method

In [119]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-09-13 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-09-13 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-09-13 11:17:00,130590,11.858,False,Finance

In [122]:
df[df["Salary"].between(60000, 70000)]
Output = False

In [125]:
df[df["Bonus %"].between(2.0, 5.0)]
Output = False

In [128]:
df[df["Start Date"].between("1991-01-01", "1992-01-01")].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
27,Scott,NaN,1991-07-11,2019-09-13 18:58:00,122367,5.218,False,Legal
75,Bonnie,Female,1991-07-02,2019-09-13 01:27:00,104897,5.118,True,Human Resources
88,Donna,Female,1991-11-27,2019-09-13 13:59:00,64088,6.155,True,Legal

In [132]:
df[df["Last Login Time"].between("08:30AM", "12:00PM")].head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2019-09-13 11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,2019-09-13 10:43:00,45906,11.598,True,Finance
10,Louise,Female,1980-08-12,2019-09-13 09:01:00,63241,15.132,True,NaN

## The .duplicate() Method

In [138]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2019-09-13 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2019-09-13 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2019-09-13 14:53:00,52119,11.343,True,Client Services

In [144]:
df[df["First Name"].duplicated(keep="last")] #display False for the last duplicate
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2019-09-13 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2019-09-13 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2019-09-13 14:53:00,52119,11.343,True,Client Services

In [148]:
mask = ~df["First Name"].duplicated(keep = False)
df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,2005-11-22,2019-09-13 06:29:00,95570,18.523,True,Engineering
688,Brian,Male,2007-04-07,2019-09-13 22:47:00,93901,17.821,True,Legal
190,Carol,Female,1996-03-19,2019-09-13 03:39:00,57783,9.129,False,Finance
887,David,Male,2009-12-05,2019-09-13 08:48:00,92242,15.407,False,Legal
5,Dennis,Male,1987-04-18,2019-09-13 01:35:00,115163,10.125,False,Legal
495,Eugene,Male,1984-05-24,2019-09-13 10:54:00,81077,2.117,False,Sales
33,Jean,Female,1993-12-18,2019-09-13 09:07:00,119082,16.180,False,Business Development
832,Keith,Male,2003-02-12,2019-09-13 15:02:00,120672,19.467,False,Legal
291,Tammy,Female,1984-11-11,2019-09-13 10:30:00,132839,17.463,True,Client Services

## The .drpo_duplicates() Method

In [4]:
import pandas as pd
df = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2019-09-16 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2019-09-16 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2019-09-16 14:53:00,52119,11.343,True,Client Services

In [5]:
len(df)

1000

In [7]:
len(df.drop_duplicates()) #will only remove the identical rows

1000

In [11]:
df.drop_duplicates(subset = ["First Name"], keep="first").head(3) # only keep the fist duplicate drop the rest

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2019-09-16 10:20:00,61602,11.849,True,Marketing
137,Adam,Male,2011-05-21,2019-09-16 01:45:00,95327,15.120,False,Distribution
300,Alan,Male,1988-06-26,2019-09-16 03:54:00,111786,3.592,True,Engineering

In [13]:
df.drop_duplicates(subset= ["Team"], keep=False) #doesnt keep any duplicates and there are no unique teams so all is gone

Empty DataFrame
Columns: [First Name, Gender, Start Date, Last Login Time, Salary, Bonus %, Senior Management, Team]
Index: []

In [16]:
df.drop_duplicates(subset=["First Name", "Team"]).head(3) #note that there are 2 Aarons because the team subsets are different

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2019-09-16 10:20:00,61602,11.849,True,Marketing
440,Aaron,Male,1990-07-22,2019-09-16 14:53:00,52119,11.343,True,Client Services
137,Adam,Male,2011-05-21,2019-09-16 01:45:00,95327,15.120,False,Distribution

In [17]:
#the drop_duplicate method has a inplace parameter so can use that as well

## The .unique() and .nunique() Methods

In [21]:
df = pd.read_csv("employees.csv", parse_dates=["Start Date","Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2019-09-16 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2019-09-16 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2019-09-16 11:17:00,130590,11.858,False,Finance

In [23]:
df["Gender"].unique() #this will give an array that will store all the unique values

[Male, Female, NaN]
Categories (2, object): [Male, Female]

In [26]:
df["Team"].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

In [29]:
len(df["First Name"].unique()) #to find the number of unique values in a column

201

In [31]:
df["First Name"].nunique() #does the same things as the statement above, minus NULL

200

In [33]:
df["First Name"].nunique(dropna=False) #dropna parameter, the null counter is set to True by default can change it

201